Criando os nomes

In [40]:
import pandas as pd
import numpy as np

Import de dados do IBGE

In [41]:
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/?qtd=200&sexo=m')
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/?qtd=200&sexo=f')

In [42]:
nomes_m.head(3)

      nome  regiao     freq  rank sexo
0     JOSE       0  5732508     1    M
1     JOAO       0  2971935     2    M
2  ANTONIO       0  2567494     3    M

In [43]:
nomes_f.head(3)

        nome  regiao      freq  rank sexo
0      MARIA       0  11694738     1    F
1        ANA       0   3079729     2    F
2  FRANCISCA       0    721637     3    F

In [44]:
print("Quantidade de nomes: " + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [45]:
frames = [nomes_m, nomes_f]
nomes = pd.concat(frames).nome.to_frame()
nomes.sample(5) #pega dados aleatorios do df

         nome
70    JOAQUIM
152      LARA
18   RAIMUNDO
136    KARINA
180     LIDIA

Incluindo IDs

In [46]:
np.random.seed(123)

In [47]:
nomes['id_aluno'] = np.random.permutation(len(nomes)) + 1
nomes

          nome  id_aluno
0         JOSE       235
1         JOAO        43
2      ANTONIO       304
3    FRANCISCO       156
4       CARLOS       343
..         ...       ...
195     ROSANE       231
196    IVONETE        99
197    LUCIANE       323
198    ISADORA       383
199      NILZA       366

[400 rows x 2 columns]

Dominios de email

In [48]:
total_alunos = len(nomes)
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)
nomes

          nome  id_aluno                 dominio
0         JOSE       235  @dominiodoemail.com.br
1         JOAO        43     @servicodoemail.com
2      ANTONIO       304     @servicodoemail.com
3    FRANCISCO       156     @servicodoemail.com
4       CARLOS       343     @servicodoemail.com
..         ...       ...                     ...
195     ROSANE       231  @dominiodoemail.com.br
196    IVONETE        99     @servicodoemail.com
197    LUCIANE       323  @dominiodoemail.com.br
198    ISADORA       383     @servicodoemail.com
199      NILZA       366     @servicodoemail.com

[400 rows x 3 columns]

Concatenando nome com o email

In [49]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()
nomes

,nome,id_aluno,dominio,email
0,JOSE,235,@dominiodoemail.com.br,jose@dominiodoemail.com.br
1,JOAO,43,@servicodoemail.com,joao@servicodoemail.com
2,ANTONIO,304,@servicodoemail.com,antonio@servicodoemail.com
3,FRANCISCO,156,@servicodoemail.com,francisco@servicodoemail.com
4,CARLOS,343,@servicodoemail.com,carlos@servicodoemail.com
...,...,...,...,...
195,ROSANE,231,@dominiodoemail.com.br,rosane@dominiodoemail.com.br
196,IVONETE,99,@servicodoemail.com,ivonete@servicodoemail.com
197,LUCIANE,323,@dominiodoemail.com.br,luciane@dominiodoemail.com.br
198,ISADORA,383,@servicodoemail.com,isadora@servicodoemail.com
199,NILZA,366,@servicodoemail.com,nilza@servicodoemail.com

Tabela de cursos

In [50]:
import html5lib

In [51]:
url = 'http://tabela-cursos.herokuapp.com/index.html'
cursos = pd.read_html(url)
cursos

[                          Nome do curso
 0                 LÃ³gica de programaÃ§Ã£o
 1                         Java para Web
 2                           C# para Web
 3                         Ruby on Rails
 4                      Cursos de Python
 5                         PHP com MySql
 6                         .NET para web
 7            Novas integraÃ§Ãµes com Java
 8                          TDD com Java
 9                   CÃ³digo limpo com C#
 10  PreparatÃ³rio para certificaÃ§Ã£o Java
 11                      Hardware bÃ¡sico
 12                PersistÃªncia com .NET
 13                  Desenvolvendo jogos
 14                     AnÃ¡lise de dados
 15                   EstatÃ­stica bÃ¡sica
 16                  Internet das coisas
 17                ProgramaÃ§Ã£o funcional
 18                Boas prÃ¡ticas em Java
 19          OrientaÃ§Ã£o objetos com Java]

In [52]:
type(cursos)

list

In [53]:
cursos = cursos[0] #convert lista para DF
type(cursos)

pandas.core.frame.DataFrame